[{"author": "Reviewed by             Emilia            – Indonesia", "date": "February 25, 2020", "comment": "I booked this trip by myself thinking I might have been joined with another group. But it was just me and my guide Agus. I was happy with that because he didn’t push me and took breaks when he saw fit. Was really good at taking photos and knew all the best spots for it. He wasn’t feeling the best and communicated that with me so we were on the same page. Always tip your guides! They work hard. Will recommend him to anyone of my friends that books.\n\nAlso the driver who picked me up was patient and called me when I slept through my alarms & messages. Appreciate that.\n\nI was also really tired after the whole hike. I didn’t book anything after and felt just doing the hike was the cheaper and healthier option."}, {"author": "Reviewed by             Rebekah            – United States", "date": "February 18, 2020", "comment": "My guide was great. He was knowledgeable and great at taking pictures. The hike itself is hard but definitely doable, just take breaks along the way. At the top, it rained so the sunrise was not great but the view was still amazing. So, regardless on if it rains or not, you should do it!"}, {"author": "Reviewed by             Anonymous            – Spain", "date": "January 28, 2020", "comment": "Maku was the best guide I could’ve asked for. He spoke about the Balinese culture, told stories, and guided us to the top of the volcano at a great pace and always patient and happy to take a break with us. The group was really small (we were 2) making it more intimate and fun. It’s quite cold as soon as you arrive at the base, so I would recommend wearing something warm and bringing something warmer for the top while awaiting the sun rise. I wasn’t a fan of the motorbikes scooting people up and down. It polluted the air and made for a rather unpleasant experience. I was embarrassed for all the young people choosing that bike ride up simply due to laziness. The walk itself is completely doable, with just a bit of climbing at the top. If little children of 6 can do it, anyone can."}]